{
    "menu": {
        "home": "Home",
        "experiences": "Experiences",
        "projects": "Projects"
    },
    "home": {
        "title": "Hi, I'm Francesco 👋",
        "content": "<p>I am a Software Engineer with an ever-evolving path, driven by curiosity and the desire to achieve more and more ambitious goals. My experience is mainly in back-end development, where I have worked on complex projects, with a special focus on performance, security, and scalable and efficient solutions.</p><p>I have contributed to the development of complex software solutions, working on both microservices architectures. My activities have ranged from query optimization to integration of caching systems, with the goal of improving application performance and scalability. In addition, I have had experience on large-scale projects with high traffic volume, dealing with challenges related to concurrency management and systems efficiency. This path has allowed me to hone technical skills on technologies such as Java, Spring Boot, SQL, Docker, Redis, Python and Git as well as develop strong problem solving skills.</p><p>For me, software development is more than a job: it is a passion that drives me to constantly challenge myself.I enjoy collaborating with the team, sharing ideas and tackling challenges together, always with the goal of creating clean, maintainable and scalable code.Adopting practices such as code review and automated testing is part of my approach to ensure quality and reliability in projects.</p><p>I am constantly engaged in learning more about new technologies and topics, with the goal of increasing my knowledge and skills.</p><p>Outside of work, I am a curious guy. I love billiards, movies and TV series, and I have played different sports such as: soccer, swimming, table tennis,... I now regularly attend the gym. I like animals, especially dogs, and in the past I also cultivated a passion for music, playing guitar.</p><p>When I am not busy writing code, I dedicate myself to studying and improving my skills, exploring new projects. I believe that curiosity and willingness to learn are the key to growing, both professionally and personally.</p>"
    },
    "experiences": {
        "soprasteria": {
            "name": "Sopra Steria",
            "start": "09.2021",
            "end": "today",
            "role": "Software Engineer",
            "tecnologies": {
                "one": "Java",
                "two": "Spring Boot",
                "three": "SQL",
                "four": "Docker",
                "five": "Redis",
                "six": "Hybris"
            },
            "description": "Software Engineer at Sopra Steria, one of Europe's leading consulting and digital services companies. During this experience, I had the opportunity to contribute to high-impact projects in the e-commerce sector, working with large retail clients.",
            "activities": {
                "one": "Development of new accessibility features in production environments with over 50 thousand monthly registrations: email verification via OTP, access and registration via Paypal and 2FA in internal tools",
                "two": "Development of a system for sending personalized emails, reducing lost sales from abandoned carts by more than 20%",
                "three": "Integration with SAP OAA framework for advanced inventory management in an omnichannel environment with over 4 thousand daily orders, optimizing sourcing and order allocation processes through SAP CAR services",
                "four": "Implementation of logic for converting points into vouchers, with custom system for changing thresholds and value of vouchers",
                "five": "Improved search results and filters for browsing within the product catalog",
                "six": "Support for troubleshooting and bugs"
            }
        }
    },
    "projects": {
        "portfolio": {
            "name": "fpetranzan.com",
            "year": "2025",
            "description": "<p>Personal portfolio, created with Next.js and Tailwind CSS, with the aim of being simple and functional.</p><p>The structure includes a home that tells who I am, a section dedicated to professional experiences, and a showcase of my projects.</p><p>Among the features, it offers a choice between light and dark theme and supports two languages (Italian and English) to ensure global usability. </p><p>The site is designed as a showcase displaying who I am, my experiences, and my work.</p><p>For this reason, I opted for a minimalist style, with essential functionality, to allow for greater focus on content and easier reading.</p>",
            "tecnologies": {
                "one": "NextJS",
                "two": "TailwindCSS",
                "three": "TypeScript",
                "four": "Docker"
            },
            "link":"https://github.com/fpetranzan/fpetranzan.com"
        },
        "adventoofcode": {
            "name": "Advent of Code",
            "year": "2024",
            "description": "<p>The Advent of Code is an annual event featuring a series of programming puzzles posted daily from Dec. 1 to Dec. 25.</p><p>It's a perfect opportunity to improve my coding skills, take on logic challenges, and have fun solving increasingly complex problems.</p><p>In 2024, I participated using Java as my language, successfully completing the puzzles until December 12.</p><p>Each day was an exciting challenge that allowed me to test my skills with new logic and algorithms, pushing me to find efficient and creative solutions.</p>",
            "tecnologies": {
                "one": "Java"
            },
            "link":"https://github.com/fpetranzan/adventofcode2024"
        },
        "java-spring-boot-security": {
            "name": "java-spring-boot-security",
            "year": "2024",
            "description": "<p>This project represents a comprehensive security system, developed using the Spring Boot framework and JSON Web Tokens (JWT) for authentication and authorization management.</p><p>Main features implemented include user registration, email verification, login, password recovery, two-factor authentication, and logout.</p><p>For data management, I used a MySQL database, while Spring Security was employed to implement role-based permissions.</p><p>Passwords are protected through the BCrypt algorithm, ensuring a high level of security.</p><p>In addition, I customized unauthorized access management to improve the user experience and strengthen protection.</p>",
            "tecnologies": {
                "one": "Java",
                "two": "Spring",
                "four": "JWT",
                "five": "SQL",
                "six": "Maven"
            },
            "link":"https://github.com/fpetranzan/java-spring-boot-security"
        },
        "memory": {
            "name": "Java Memory Game",
            "year": "2019",
            "description": "<p>Java Memory Game is my first complex project developed during my studies. It is a digital version of the classic 'Memory' game, implemented in Java 8 using Java Swing.</p><p>The game includes several modes (single player, two players, against the computer), difficulty levels (4x4, 6x6, 8x8), and a save/reload system for games. </p><p>Additional features such as timed turn management and dynamic scoring make the experience more challenging and addictive.</p><p>Although it has some bugs and room for improvement, this project represents an important milestone in my software development journey.</p>",
            "tecnologies": {
                "one": "Java",
                "two": "Java Swing"
            },
            "link":"https://github.com/fpetranzan/java-memory-game"
        }
    },
    "metadata": {
        "home": {
            "description": "Francesco Petranzan Portfolio, Software developer. All about me, my career and my project."
        },
        "experiences": {
            "title": "Experiences",
            "description": "All about my experiences.",
            "url": "experiences"
        },
        "projects": {
            "title": "Projects",
            "description": "All about my projects, ideas and collaborations.",
            "url": "projects"
        }
    }
}