{
    "menu": {
        "home": "Home",
        "experiences": "Lavori",
        "projects": "Progetti"
    },
    "home": {
        "title": "Ciao, io sono Francesco 👋",
        "content": "<p>sono un Software Engineer con un percorso in continua evoluzione, guidato dalla curiosità e dalla voglia di raggiungere traguardi sempre più ambiziosi. La mia esperienza si concentra principalmente nello sviluppo back-end, dove ho lavorato su progetti complessi, con un focus particolare su performance, sicurezza e su soluzioni scalabili ed efficienti.</p><p>Ho contribuito allo sviluppo di soluzioni software complesse, lavorando sia su architetture a microservizi. Le mie attività hanno spaziato dall'ottimizzazione delle query all'integrazione di sistemi di caching, con l'obiettivo di migliorare le prestazioni e la scalabilità delle applicazioni. Inoltre, ho avuto esperienza su progetti di grande scala con un elevato volume di traffico, affrontando sfide legate alla gestione della concorrenza e all'efficienza dei sistemi. Questo percorso mi ha permesso di affinare competenze tecniche su tecnologie come Java, Spring Boot, SQL, Docker, Redis, Python e Git oltre a sviluppare una forte capacità di problem solving.</p><p>Per me, lo sviluppo software è più di un lavoro: è una passione che mi porta a mettermi continuamente alla prova. Mi piace collaborare con il team, condividere idee e affrontare insieme le sfide, sempre con l’obiettivo di creare codice pulito, mantenibile e scalabile. L’adozione di pratiche come il code review e i test automatizzati fa parte del mio approccio per garantire qualità e affidabilità nei progetti.</p><p>Sono costantemente impegnato nell’approfondimento di nuove tecnologie e tematiche, con l’obiettivo di accrescere le mie conoscenze e competenze.</p><p>Al di fuori del lavoro, sono un ragazzo curioso. Amo il biliardo, i film e le serie TV, e ho praticato diversi sport come: calcio, nuoto, ping pong,... ora frequento regolarmente la palestra. Mi piacciono gli animali, soprattutto i cani, e in passato ho coltivato anche la passione per la musica, suonando la chitarra.</p><p>Quando non sono impegnato a scrivere codice, mi dedico allo studio e al miglioramento delle mie competenze, esplorando nuovi progetti. Credo che la curiosità e la voglia di imparare siano la chiave per crescere, sia professionalmente che personalmente.</p>"
    },
    "experiences": {
        "soprasteria": {
            "name": "Sopra Steria",
            "start": "09.2021",
            "end": "oggi",
            "role": "Software Engineer",
            "tecnologies": {
                "one": "Java",
                "two": "Spring Boot",
                "three": "SQL",
                "four": "Docker",
                "five": "Redis",
                "six": "Hybris"
            },
            "description": "Software Engineer presso Sopra Steria, una delle principali aziende europee nel campo della consulenza e dei servizi digitali. Durante questa esperienza, ho avuto l'opportunità di contribuire a progetti di grande impatto nel settore e-commerce, collaborando con clienti della grande distribuzione.",
            "activities": {
                "one": "Sviluppo di nuove funzionalità in tema di accessibilità in ambienti di produzione con oltre 50mila registrazioni mensili: verifica della mail tramite OTP, accesso e registrazione tramite Paypal e 2FA in strumenti interni",
                "two": "Sviluppo di un sistema per l’invio di email personalizzate, con riduzione di oltre il 20% delle vendite perse da carrelli abbandonati",
                "three": "Integrazione con il framework SAP OAA per una gestione avanzata dell’inventario in un ambiente omnicanale con oltre 4mila ordini giornalieri, ottimizzando i processi di sourcing e allocazione ordini attraverso servizi SAP CAR",
                "four": "Implementazione di logiche per la conversione dei punti in buoni, con sistema custom per la modifica delle soglie e valore dei buoni",
                "five": "Miglioramento dei risultati di ricerca e filtri per la navigazione all’interno del catalogo prodotti",
                "six": "Supporto alla risoluzione di problemi e bug"
            }
        }
    },
    "projects": {
        "portfolio": {
            "name": "fpetranzan.me",
            "year": "2025",
            "description": "<p>Portfolio personale, realizzato con Next.js e Tailwind CSS, con l’obiettivo di essere semplice e funzionale.</p><p>La struttura include una home che racconta chi sono, una sezione dedicata alle esperienze professionali e una vetrina dei miei progetti.</p><p>Tra le funzionalità, offre la possibilità di scegliere tra tema chiaro e scuro e supporta due lingue (italiano e inglese) per garantire una fruibilità globale.</p><p>Il sito è concepito come una vetrina che mostra chi sono, le mie esperienze e i miei lavori.</p><p>Per questo motivo, ho optato per uno stile minimale, con funzionalità essenziali, per permettere una maggiore concentrazione sui contenuti e una lettura facilitata.</p>",
            "tecnologies": {
                "one": "NextJS",
                "two": "TailwindCSS",
                "three": "TypeScript",
                "four": "Docker"
            },
            "link":"https://github.com/fpetranzan/fpetranzan.me"
        },
        "adventoofcode": {
            "name": "Advent of Code 2024",
            "year": "2024",
            "description": "<p>L'Advent of Code è un evento annuale che propone una serie di puzzle di programmazione, pubblicati ogni giorno dal 1° al 25 dicembre.</p><p>È un'occasione perfetta per migliorare le mie competenze di coding, affrontare sfide logiche e divertirmi risolvendo problemi sempre più complessi.</p><p>Nel 2024, ho partecipato utilizzando come linguaggio Java, completando con successo i puzzle fino al 12 dicembre.</p><p>Ogni giornata è stata una sfida stimolante che mi ha permesso di mettere alla prova le mie abilità con nuove logiche e algoritmi, spingendomi a trovare soluzioni efficienti e creative.</p>",
            "tecnologies": {
                "one": "Java"
            },
            "link":"https://github.com/fpetranzan/adventofcode2024"
        },
        "java-spring-boot-security": {
            "name": "java-spring-boot-security",
            "year": "2024",
            "description": "<p>Questo progetto rappresenta un sistema di sicurezza completo, sviluppato utilizzando il framework Spring Boot e JSON Web Tokens (JWT) per la gestione dell’autenticazione e dell’autorizzazione.</p><p>Tra le principali funzionalità implementate ci sono la registrazione degli utenti, la verifica delle email, il login, il recupero della password, l’autenticazione a due fattori e il logout.</p><p>Per la gestione dei dati ho utilizzato un database MySQL, mentre Spring Security è stato impiegato per implementare autorizzazioni basate su ruoli.</p><p>Le password sono protette attraverso l’algoritmo BCrypt, garantendo un alto livello di sicurezza.</p><p>Inoltre, ho personalizzato la gestione degli accessi non autorizzati per migliorare l'esperienza utente e rafforzare la protezione.</p>",
            "tecnologies": {
                "one": "Java",
                "two": "Spring",
                "four": "JWT",
                "five": "SQL",
                "six": "Maven"
            },
            "link":"https://github.com/fpetranzan/java-spring-boot-security"
        },
        "memory": {
            "name": "Java Memory Game",
            "year": "2019",
            "description": "<p>Java Memory Game è il mio primo progetto complesso sviluppato durante il percorso di studi. Si tratta di una versione digitale del classico gioco 'Memory', implementata in Java 8 utilizzando Java Swing.</p><p>Il gioco include diverse modalità (singolo giocatore, due giocatori, contro il computer), livelli di difficoltà (4x4, 6x6, 8x8), e un sistema di salvataggio/ricarica delle partite.</p><p>Funzionalità aggiuntive come gestione dei turni a tempo e punteggio dinamico rendono l'esperienza più sfidante e coinvolgente.</p><p>Sebbene presenti alcuni bug e margini di miglioramento, questo progetto rappresenta un traguardo importante nel mio percorso di sviluppo software.</p>",
            "tecnologies": {
                "one": "Java",
                "two": "Java Swing"
            },
            "link":"https://github.com/fpetranzan/java-memory-game"
        }
    },
    "metadata": {
        "home": {
            "description": "Francesco Petranzan Portfolio, Software developer. Tutto su di me, la mia carriera e i miei progetti."
        },
        "experiences": {
            "title": "Lavori",
            "description": "Tutto sui miei lavori ed esperienze.",
            "url": "lavori"
        },
        "projects": {
            "title": "Progetti",
            "description": "Tutto sui miei progetti, le mie idee e le mie collaborazioni.",
            "url": "progetti"
        }
    }
}